#include <stdio.h>

/*
**Задача 3 (Лице на фигура):** Въвеждат се размерите на геометрична фигура. Да се напише програма, която пресмята лицето й.
Фигурите са четири вида: **квадрат (s), правоъгълник (r), кръг (c) и триъгълник (t).**
На първия ред на входа се чете вида на фигурата (square, rectangle, circle или triangle).
- Ако фигурата е квадрат, на следващия ред се чете едно число – *дължина на страната му.*
- Ако фигурата е правоъгълник, на следващите два реда се четат две числа – *дължините на страните му.*
- Ако фигурата е кръг, на следващия ред се чете едно число – *радиусът на кръга.*
- Ако фигурата е триъгълник, на следващите два реда се четат две числа – *дължината на страната му и дължината на височината към нея.*

*Вход: s 5, Изход: 25
Вход: r 7 2.5, Изход: 17.5
Вход: c 6, Изход: 113.097*
*/
int main(void)
{
    char figure = '0';
    double result = 0;
    unsigned int param1 = 0, param2 = 0;
    scanf("%c", &figure);
    switch (figure)
    {
    case 's':
        scanf("%u", &param1);
        result = param1 * param1;
        break;
    case 'r':
        scanf("%u%u", &param1, &param2);
        result = param1 * param2;
        break;
    case 'c':
        scanf("%u", &param1);
        result = (param1 * param1) * 3.14;
        break;
    case 't':
        scanf("%u%u", &param1, &param2);
        result = (param1 * param2) / 2.0;
        break;

    default:
        break;
    }
    printf("%.2lf", result);
    return 0;
}
