#include <stdio.h>

/*
**Задача 2 (Време + 15 минути):** Да се напише програма, която при подадени час и минути от 24-часово денонощие изчислява колко ще е часът след 15 минути. Резултатът да се отпечата във формат hh:mm. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. Часовете и минутите се изписват винаги с по две цифри и с водеща нула, когато числото е едноцифрено.
*Вход: 1 46, Изход: 02:01
Вход: 0 1, Изход: 00:16
Вход: 23 59, Изход: 00:14*
*/
int main(void)
{
    unsigned short hours = 0;
    unsigned short minutes = 0;
    scanf("%hu %hu", &hours, &minutes);
    hours = (hours + (minutes + 15) / 60) % 24;
    minutes = (minutes + 15) % 60;
    printf("%02hu:%02hu", hours, minutes);
    return 0;
}
