#include <stdio.h>
/*
Ще казваме, че редица от числа е трион, ако всяко число в нея е едновременно или по-голямо или равно от двата си съседа, или по-малко или равно от тях. За първия и последния елемент имаме само по един съсед. Да се напише програма, която при подадени 5 на брой цели числа извежда на стандартния изход "yes", ако въведената редица е трион и "no", ако не е.
*Вход: 1 5 1 0 3, Изход: no
Вход: -10 10 -2 11 -22, Изход: yes*
*/
int main()
{
    int el1 = 0, el2 = 0, el3 = 0, el4 = 0, el5 = 0;
    scanf("%d%d%d%d%d", &el1, &el2, &el3, &el4, &el5);
    if (!((el2 >= el1 && el2 >= el3) || (el2 <= el1 && el2 <= el3)))
    {
        printf("no");
    }
    else if (!((el3 >= el2 && el3 >= el4) || (el3 <= el2 && el3 <= el4)))
    {
        printf("no");
    }
    else if (!((el4 >= el3 && el4 >= el5) || (el4 <= el3 && el4 <= el5)))
    {
        printf("no");
    }
    else
    {
        printf("yes");
    }
    return 0;
}